src/cf/Catalogs/пбп_МетодыИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>пбп_МетодыИнтеграции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_НастройкиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыREST</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.пбп_ТипыJSON</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/пбп_ТипыJSON.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>пбп_ТипыJSON</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Null</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Массив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/пбп_МетодыИнтеграции/Ext/ManagerModule.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПредопределенныеСоответствия() Экспорт
	
	ТЗПредопределенныхЗначений = пбп_ИнтеграцииПереопределяемый.ПредопределенныеЗначенияМетодыИнтеграции();
	
	пбп_ПредопределенныеЗначения.ОбработатьПредопределенныеЗначения(
		ТЗПредопределенныхЗначений,
		Справочники.пбп_МетодыИнтеграции);
	
КонецПроцедуры

//  Получает структуру параметров метода интеграции со значениями по умолчанию
//
// Параметры:
//   *МетодИнтеграции - СправочникСсылка.пбп_МетодыИнтеграции - ссылка на метод, параметры которого получаем.
//   *ЗаполнятьПоУмолчанию - Булево - добавлять ли в возвращаемую структуру значения по умолчанию
//   	**Ложь - возвращает структуру вида ИмяПараметра<Строка>:ТипЗначения<ПеречислениеСсылка.пбп_ТипыJSON>
//   	**Истина - возвращает структуру вида ИмяПараметра<Строка>:ЗначениеПоУмолчанию<Строка>
// Возвращаемое значение:
//   Структура
Функция ПолучитьСтруктуруПараметровREST(МетодИнтеграции, ЗаполнятьПоУмолчанию = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пбп_МетодыИнтеграцииПараметрыREST.Имя КАК Имя,
		|	пбп_МетодыИнтеграцииПараметрыREST.Тип КАК Тип,
		|	пбп_МетодыИнтеграцииПараметрыREST.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
		|ИЗ
		|	Справочник.пбп_МетодыИнтеграции.ПараметрыREST КАК пбп_МетодыИнтеграцииПараметрыREST
		|ГДЕ
		|	пбп_МетодыИнтеграцииПараметрыREST.Ссылка = &МетодИнтеграции";
	
	Запрос.УстановитьПараметр("МетодИнтеграции", МетодИнтеграции);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		Имя = Выборка.Имя; 
		
		Если ЗаполнятьПоУмолчанию Тогда
			Результат.Вставить(Имя, ПривестиЗначениеПоУмолчаниюREST(Выборка.ЗначениеПоУмолчанию, Выборка.Тип));	
		Иначе	
			Результат.Вставить(Имя, Выборка.Тип);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

//  Получает структуру параметров метода интеграции со значениями по умолчанию
//
// Параметры:
//   Значение - СправочникСсылка.пбп_МетодыИнтеграции - ссылка на метод, параметры которого получаем.
//   ТипJSON - ПеречислениеСсылка.пбп_ТипыJSON - добавлять ли в возвращаемую структуру значения по умолчанию
//
// Возвращаемое значение:
//   Строка - приведенное к JSON поле типа
Функция ПривестиЗначениеПоУмолчаниюREST(Значение, ТипJSON) Экспорт
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Если ТипJSON = Перечисления.пбп_ТипыJSON.Строка Тогда
			Возврат "";
		ИначеЕсли ТипJSON = Перечисления.пбп_ТипыJSON.Число Тогда
			Возврат 0;
		Иначе
			Возврат "null";
		КонецЕсли;
	КонецЕсли;	
	
	Если ТипJSON = Перечисления.пбп_ТипыJSON.Булево Тогда
		Возврат ?(Значение, "true", "false");
	ИначеЕсли ТипJSON = Перечисления.пбп_ТипыJSON.Дата Тогда
		Возврат Формат(Значение, "ДФ=yyyy-MM-dd");
	ИначеЕсли ТипJSON = Перечисления.пбп_ТипыJSON.Число Тогда
		Возврат Формат(Значение, "ЧГ=0");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#КонецЕсли
